In [1]:
 %config Completer.use_jedi = False

In [2]:
import pandas as pd 
import numpy as np

In [3]:
!type ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [4]:
df = pd.read_csv("ex1.csv")
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_table("ex1.csv", sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
pd.read_csv("ex2.csv", header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [7]:
pd.read_csv("ex2.csv", names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
names=['a','b','c','d','message']
pd.read_csv("ex2.csv",names=names,index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [9]:
parsed = pd.read_csv("csv_mindex.csv",index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [10]:
list(open('ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [11]:
result = pd.read_table('ex3.txt',sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [12]:
!type ex4.csv
pd.read_csv("ex4.csv", skiprows=[0, 2, 3])

# CzeĹ›Ä‡!
a,b,c,d,message
# ChciaĹ‚em tylko trochÄ™ utrudniÄ‡ TwojÄ… pracÄ™.
# Kto w ogĂłle wczytuje pliki CSV za pomocÄ… komputera?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
!type ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [14]:
result = pd.read_csv("ex5.csv")
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [15]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [16]:
result = pd.read_csv("ex5.csv", na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [17]:
sentinels = {'message':['foo','NA'], 'something':['two']}
pd.read_csv("ex5.csv", na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [18]:
pd.options.display.max_rows = 10

In [19]:
result = pd.read_csv("ex6.csv")
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [20]:
pd.read_csv("ex6.csv", nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [21]:
chunker = pd.read_csv("ex6.csv", chunksize=1000)
chunker

In [22]:
chunker = pd.read_csv("ex6.csv", chunksize=1000)
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(),fill_value=0)
    
tot = tot.sort_values(ascending=False)
tot[:10]

C:\Users\B_Majda\Anaconda3\envs\pandas\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [23]:
data = pd.read_csv("ex5.csv")
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [24]:
data.to_csv('out.csv')

In [25]:
!type out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [26]:
import sys

In [27]:
data.to_csv(sys.stdout,sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [28]:
data.to_csv(sys.stdout,na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [29]:
data.to_csv(sys.stdout,index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [30]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [31]:
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates)
ts.to_csv('tseries.csv')

In [32]:
!type tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [33]:
!type ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [34]:
import csv
f = open("ex7.csv")
reader = csv.reader(f)

In [35]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [37]:
with open('ex7.csv') as f:
    lines = list(csv.reader(f))

header, values = lines[0], lines[1:]
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [43]:
obj = """
{"name":"Wes",
 "places_lived": ["United States","Spain", "Germany"],
  "pet": null,
  "siblings": [{"name":"Scott", "age":30, "pets":["Zeus","Zuko"]},
               {"name":"Katie", "age":38, "pets":["Sixes","Staache","Cisco"]}]
}"""

In [44]:
import json 
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Staache', 'Cisco']}]}

In [45]:
asjoson = json.dumps(result)

In [46]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [47]:
!type example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [49]:
data = pd.read_json("example.json")
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [50]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [51]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [52]:
tables = pd.read_html("fdic_failed_bank_list.html")
len(tables)

1

In [53]:
failures = tables[0]

In [54]:
failures.head

<bound method NDFrame.head of                              Bank Name             City  ST   CERT  \
0                          Allied Bank         Mulberry  AR     91
1         The Woodbury Banking Company         Woodbury  GA  11297
2               First CornerStone Bank  King of Prussia  PA  35312
3                   Trust Company Bank          Memphis  TN   9956
4           North Milwaukee State Bank        Milwaukee  WI  20364
..                                 ...              ...  ..    ...
542                 Superior Bank, FSB         Hinsdale  IL  32646
543                Malta National Bank            Malta  OH   6629
544    First Alliance Bank & Trust Co.       Manchester  NH  34264
545  National State Bank of Metropolis       Metropolis  IL   3815
546                   Bank of Honolulu         Honolulu  HI  21029

                   Acquiring Institution        Closing Date  \
0                           Today's Bank  September 23, 2016
1                            United Bank     August 19, 2016
2    First-Citizens Bank & Trust Company         May 6, 2016
3             The Bank of Fayette County      April 29, 2016
4    First-Citizens Bank & Trust Company      March 11, 2016
..                                   ...                 ...
542                Superior Federal, FSB       July 27, 2001
543                    North Valley Bank         May 3, 2001
544  Southern New Hampshire Bank & Trust    February 2, 2001
545              Banterra Bank of Marion   December 14, 2000
546                   Bank of the Orient    October 13, 2000

          Updated Date
0    November 17, 2016
1    November 17, 2016
2    September 6, 2016
3    September 6, 2016
4        June 16, 2016
..                 ...
542    August 19, 2014
543  November 18, 2002
544  February 18, 2003
545     March 17, 2005
546     March 17, 2005

[547 rows x 7 columns]>

In [56]:
close_timestamp = pd.to_datetime(failures['Closing Date'])
close_timestamp.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [57]:
from lxml import objectify
path ="mta_perf/Performance_MNR.xml"
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [59]:
data = [] 
skip_fields = ['PARENT_SEQ','INDICATOR_SEQ', 'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [60]:
perf = pd.DataFrame(data)
perf.head

<bound method NDFrame.head of               AGENCY_NAME                        INDICATOR_NAME  \
0    Metro-North Railroad  On-Time Performance (West of Hudson)
1    Metro-North Railroad  On-Time Performance (West of Hudson)
2    Metro-North Railroad  On-Time Performance (West of Hudson)
3    Metro-North Railroad  On-Time Performance (West of Hudson)
4    Metro-North Railroad  On-Time Performance (West of Hudson)
..                    ...                                   ...
643  Metro-North Railroad                Escalator Availability
644  Metro-North Railroad                Escalator Availability
645  Metro-North Railroad                Escalator Availability
646  Metro-North Railroad                Escalator Availability
647  Metro-North Railroad                Escalator Availability

                                           DESCRIPTION  PERIOD_YEAR  \
0    Percent of commuter trains that arrive at thei...         2008
1    Percent of commuter trains that arrive at thei...         2008
2    Percent of commuter trains that arrive at thei...         2008
3    Percent of commuter trains that arrive at thei...         2008
4    Percent of commuter trains that arrive at thei...         2008
..                                                 ...          ...
643  Percent of the time that escalators are operat...         2011
644  Percent of the time that escalators are operat...         2011
645  Percent of the time that escalators are operat...         2011
646  Percent of the time that escalators are operat...         2011
647  Percent of the time that escalators are operat...         2011

     PERIOD_MONTH            CATEGORY FREQUENCY INDICATOR_UNIT YTD_TARGET  \
0               1  Service Indicators         M              %         95
1               2  Service Indicators         M              %         95
2               3  Service Indicators         M              %         95
3               4  Service Indicators         M              %         95
4               5  Service Indicators         M              %         95
..            ...                 ...       ...            ...        ...
643             8  Service Indicators         M              %         97
644             9  Service Indicators         M              %         97
645            10  Service Indicators         M              %         97
646            11  Service Indicators         M              %         97
647            12  Service Indicators         M              %         97

    YTD_ACTUAL MONTHLY_TARGET MONTHLY_ACTUAL
0         96.9             95           96.9
1           96             95             95
2         96.3             95           96.9
3         96.8             95           98.3
4         96.6             95           95.8
..         ...            ...            ...
643                        97
644                        97
645                        97
646                        97
647                        97

[648 rows x 12 columns]>

In [61]:
from io import StringIO 
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [62]:
root

In [63]:
root.get('href')

'http://www.google.com'

In [64]:
root.text

'Google'

In [65]:
frame = pd.read_csv("ex1.csv")
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [66]:
frame.to_pickle('frame_pickle')

In [67]:
pd.read_pickle('frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [69]:
frame = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('mydata.h5')
store['obj1']= frame
store['objl_col'] = frame['a']

In [70]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [72]:
store['obj1']

           a
0   0.115278
1  -1.192821
2   0.254939
3  -0.257094
4   1.965801
..       ...
95  0.016263
96  2.049280
97 -1.994909
98 -2.165021
99 -1.656510

[100 rows x 1 columns]

In [73]:
store.put('obj2', frame, format='table')
store.select('obj2', where=['index >= 10 and index <=15'])

           a
10 -0.766261
11  0.664561
12  0.279571
13  0.091818
14  1.940927
15  0.018666

In [75]:
store.close()

In [76]:
frame.to_hdf('mydata.h5', 'obj3', format='table')
pd.read_hdf('mydata.h5', 'obj3',where=['index < 5'])

          a
0  0.115278
1 -1.192821
2  0.254939
3 -0.257094
4  1.965801

In [79]:
xlsx =  pd.ExcelFile('ex1.xlsx')
pd.read_excel(xlsx,'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [80]:
writer = pd.ExcelWriter('ex2.xlsx')
frame.to_excel(writer, 'Sheet1')
writer.save()

In [81]:
frame.to_excel('ex2.xlsx')

In [82]:
import requests

In [83]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [84]:
data = resp.json()

In [85]:
data[0]['title']

'BUG: DataFrameGroupBy.transform with axis=1 fails'

In [87]:
issues = pd.DataFrame(data,columns=['number','title','labels','state'])
issues

,number,title,labels,state
0,36308,BUG: DataFrameGroupBy.transform with axis=1 fails,"[{'id': 697792067, 'node_id': 'MDU6TGFiZWw2OTc...",open
1,36307,TYPING: `df.columns.levels` raises mypy error ...,[],open
2,36306,BUG: DataFrameGroupBy.apply with as_index Fals...,"[{'id': 697792067, 'node_id': 'MDU6TGFiZWw2OTc...",open
3,36305,ENH: Support MultiIndex columns in parquet (#3...,[],open
4,36304,PERF: creating string Series/Arrays from seque...,[],open
...,...,...,...,...
25,36281,QST: Appending to pandas DataFrames,"[{'id': 34444536, 'node_id': 'MDU6TGFiZWwzNDQ0...",open
26,36280,PERF: CategoricalDtype.__eq__,[],open
27,36279,QST: Python 3.9 testing in CI,"[{'id': 717120670, 'node_id': 'MDU6TGFiZWw3MTc...",open
28,36278,[TST]: Add test for 24768,"[{'id': 13098779, 'node_id': 'MDU6TGFiZWwxMzA5...",open
29,36277,ENH: add peek function,"[{'id': 219960758, 'node_id': 'MDU6TGFiZWwyMTk...",open

In [88]:
import sqlite3
query = """
    CREATE TABLE test
    (a varchar(20), b varchar(20),
    c real, d integer);
"""

In [89]:
con = sqlite3.connect('mydata.sqlite')
con.execute(query)

In [90]:
con.commit()

In [95]:
data = [('Atlanta','Georgia',1.25,6),
       ('Tallahassee', 'Florida',2.6,3),
       ('Scaramento', 'California',1.7,5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)

In [96]:
con.commit()

In [97]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Scaramento', 'California', 1.7, 5)]

In [98]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [99]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Scaramento  California  1.70  5

In [101]:
import sqlalchemy as sqla

In [102]:
db = sqla.create_engine('sqlite://mydata.sqlite')
pd.read_sql('select * from table test', db)

ArgumentError: Invalid SQLite URL: sqlite://mydata.sqlite
Valid SQLite URL forms are:
 sqlite:///:memory: (or, sqlite://)
 sqlite:///relative/path/to/file.db
 sqlite:////absolute/path/to/file.db